Repository: oscarahalvorsen/masterproject
Catalog: maalfrid/tmx/udir.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: This main subject area deals with the interaction between science, technology and society.
nb: Hovedområdet omfatter dagligliv, samfunnsklasser og politikk, og de åndelige og materielle vitnesbyrd som disse samfunnene skapte.

source: Norwegian is an important school subject for cultural understanding, communication, education and development of identity.
nb: Norsk tegnspråk er et visuelt-gestuelt og nasjonalt språk utviklet i døvemiljøet i Norge.

source: in Mathematics for the natural sciences is the most basic skill in the subject.
nb: i matematikk for realfag er den mest grunnleggende ferdigheten i matematikk.

source: listen to, understand and talk about the content of oral narratives and other texts
nb: lytte til, forstå og samtale om innholdet i muntlige fortellinger og andre tekster

source: If the sum of these functions is to be 2, then both functions must have the value 1 simultaneously (for the same value of
nb: Skal summen av de to funksjonene bli 2, må derfor begge funksjonene ha verdien 1 samtidig (for samme verdi av

source: Which roles do we play kindergarten?
nb: Hvilke roller har vi i barnehagen?

source: Some employees believe these children are sad and frustrated.
nb: Noen ansatte mener at disse barna er lei seg og frustrerte.

source: CURRICULUM FOR THE COMMON CORE SUBJECT OF MATHEMATICS (MAT1-04)
nb: Læreplan i matematikk fellesfag (MAT1-04)

source: recognise Islamic art and make use of aesthetic expressions related to Islam
nb: gjenkjenne kunst og gjøre bruk av estetiske uttrykk knyttet til islam

source: The pupils shall be encouraged to experiment on their own in the subject.
nb: utforske historiske, sosiale og kulturelle kontekster for instrument- og

source: The main subject area deals with how communication is affected by cultural factors such as national culture, group affiliation, ethnicity, gender and professional and occupational background.
nb: Hovedområdet dreier seg om hvordan kommunikasjon påvirkes av kulturelle faktorer, som nasjonal kultur, gruppetilhørighet, etnisitet, kjønn og fag- og yrkesbakgrunn.

source: Pedagogy and ergonomics – hand in hand
nb: Pedagogikk og ergonomi – hånd i hånd

source: define the terms current, voltage and resistance, and apply the principles of conservation of charge and energy to simple and branched direct current circuits
nb: definere begrepene strøm, spenning og resistans, og bruke prinsippene om bevaring av ladning og energi på enkle og forgreinede likestrømskretser

source: Vg2 educational program for sports, music, dance and drama, art, design and architecture and media and communication: The student must have one point of view.
nb: Vg2 utdanningsprogram for idrettsfag, musikk, dans og drama, kunst, design og arkitektur og medier og kommunikasjon:

source: English is part of the practical language competence and means being able to read and understand, to explore and reflect upon increasingly more demanding texts and thus gain insight across cultures and disciplines.
nb: i engelsk er en del av den praktiske språkkompetansen og innebærer at en kan lese med forståelse, utforske og reflektere over stadig mer krevende tekster og slik skaffe seg innsikt på tvers av kulturer og fagfelt.

source: test different ideas and possibilities with recycled materials and
nb: drøfte bakgrunnen for verdenskrigene og et utvalg andre sentrale kriger

source: give an account of and reflect on the relationship between spoken and written language
nb: gjøre rede for forholdet mellom muntlig og skriftlig språk

source: coverage in 2008 than in 2007.
nb: omtale i medier i 2008 enn i 2007.

source: Their study indicates that 1 out of 10 children injure themselves in a Norwegian ECEC setting each year.
nb: Studien deres viser at 1 av 10 barn skader seg i en norsk barnehage hvert år.

source: use terminology from rhetoric to analyse and assess texts from various genres
nb: produsere og vurdere egne tekster i ulike sjangere

source: Soft colours result in a calmer atmosphere’, according to Häll.
nb: Dempede farger gir et roligere uttrykk, mener Häll.

source: The main focus is on seeing what is involved in learning a new language and seeing relationships between English, one's native language and other languages.
nb: Bruk av ulike medier og utvikling av et språklig repertoar på tvers av fag, emner og gjerne språkmodaliteter er sentrale i dette hovedområdet.

source: the causes of and initiatives that can be taken to prevent racism, discrimination and hate speech, and
nb: årsaker til og tiltak som kan forebygge rasisme, diskriminering og hatefulle ytringer, og

source: discuss and elaborate on the background of the two world wars and discuss and elaborate on the impact these wars had on the Nordic countries and the international community
nb: gjøre rede for årsaker til utviklingen av kunnskaps- og informasjonssamfunnet og diskutere virkninger av denne utviklingen for individ og samfunn

source: The municipal health and care services can be consulted if necessary for advice on infection control measures at schools.
nb: Testing, isolasjon av syke, smitteoppsporing og karantene (TISK) har vært en viktig strategi for å begrense smittespredning.

source: This is accomplished through work in various genres in both official languages, and the pupils are met with increasing demands as to their understanding of the relationship between the form and function of the text.
nb: Hovedområdet omfatter utvikling av tekstkompetanse gjennom arbeid med ulike sjangere, der kravene til forståelse av sammenhenger mellom tekstenes form og funksjon øker.

source: Interaction between local school authorities and school leaders, schools and training establishments + any other stakeholders.
nb: De første eksmeplene på slik medvirkning de kom opp med, handlet om vurdering, og særlig bruken av egenvurdering i fag.

source: formulas and explore these using digital tools
nb: uttrykk og som underholdnings- og forbruksvare

source: Recommendations on gatherings from different schools
nb: Smitteverntiltakene må tilpasses den lokale situasjonen.

source: It also involves participating in a text culture and developing the ability to understand and interpret a variety of texts.
nb: Det innebærer også å ta del i en tekstkultur og utvikle evnen til å forstå og tolke ulike tekster.

source: calculate values of Ka, Kb and Kw
nb: gjøre beregninger med Ka, Kb og Kw

source: reflect on how technology and communication affect the global economy and the division of labour
nb: reflektere over hvordan teknologi og kommunikasjon påvirker global økonomi og arbeidsdeling

source: in RLE involves experiencing and understanding written texts.
nb: i RLE innebærer å oppleve og forstå tekster.

source: In addition, teaching shall help develop an understanding of the relationship between biological production, nature’s tolerance limits and human activity.
nb: Videre skal opplæringen bidra til å utvikle forståelse av sammenhengen mellom biologisk produksjon, naturens tålegrenser og menneskelig aktivitet.

source: History also includes how humans create pictures and shape their own understanding of the past.
nb: Historie omfatter hvordan mennesker skaper bilder av og former sin forståelse av fortiden.

source: It also means using animations to illustrate and explain chemistry-related concepts.
nb: Det betyr også å bruke animasjoner til å illustrere og utdype kjemifaglig stoff.

source: Design and product development
nb: Design og produktutvikling

source: Teachers’ reflections on conditions for participation for children using cochlear implants.
nb: Barnehagepersonalets refleksjoner om vilkår for deltakelse for barn med cochleaimplantat.

source: use dictionaries and digital aids
nb: bruke ordbøker og digitale hjelpemidler

source: measures therefore help control the spread of the virus and make it possible to keep schools open.
nb: Tiltak i samfunnet bidrar derfor til å kontrollere epidemien for at skoler kan holdes

source: Teaching hours are given in 60-minute units:
nb: Timetall oppgitt i 60 minutters enheter

source: write cohesively with personal and functional handwriting
nb: bruke kilder og oppslagsverk i arbeid med tekster

source: choose suitable measurement units and convert between different measurement units
nb: velge passende måleenheter og regne om mellom ulike måleenheter

source: use rhetorical concepts to analyse and evaluate different types of non-fiction texts
nb: bruke bibliotekets sentrale databaser og andre faglige kilder, både tradisjonelle og elektroniske, i egne arbeider

source: discuss and elaborate on different forms of searching for religions in our time
nb: gjøre rede for og vurdere ulike former for religions- og livssynskritikk

source: elaborate on the relationship between spoken and written language and characteristics of a selection of Norwegian dialects
nb: vurdere Samelovens språkregler og Sametingets opprettelse i forhold til språksituasjon og tospråklighet

source: Some mentioned restrictions on children’s outdoor activities when it is slippery outside.
nb: Noen forteller om restriksjoner på barnas uteaktiviteter når det er glatt utendørs.

source: The item was not used in the previous TIMSS Advanced study and does not, therefore, show the development of performance over time.
nb: Oppgaven ble ikke brukt i den forrige TIMSS Advanced-studien, og viser derfor ikke utvikling i prestasjoner over tid.

source: The main subject area Means of competition is concerned with how product, price, distribution and market communication can be used as an aid to improving competition factors in the consumer market.
nb: Hovedområdet situasjonsanalyse og markedsinformasjon dreier seg om bruk av situasjons- og konkurrentanalyse som beslutningsgrunnlag for målformuleringer og strategier.

source: use simple spoken phrases to obtain help in understanding and being understood
nb: bruke enkle muntlige fraser for å få hjelp til å forstå og bli forstått

source: discuss and elaborate on the value of human life, and place racism and discrimination in a historical and contemporary perspective with pupils from other schools by using digital communication tools
nb: drøfte menneskeverd, rasisme og diskriminering i et historisk og nåtidig perspektiv med elever fra andre skoler ved å bruke digitale kommunikasjonsverktøy

source: talk about and explain what a philosophy of life is, and show how such a philosophy of life is expressed in different ways
nb: vise evne til dialog om religions- og livssynsspørsmål og vise respekt for ulike religioner og livssyn

source: reformulate expressions and solve equations, inequalities and systems of equations of the first and second order and simple equations with exponential and logarithmic functions, using algebra and digital aids
nb: omforme uttrykk og løse ligninger, ulikheter og ligningssystemer av første og andre grad og enkle ligninger med eksponential- og logaritmefunksjoner, både ved regning og med digitale verktøy

source: in one’s mother tongue includes using the language in different ways in a variety of contexts.
nb: i morsmål innebærer å bruke språket på ulike måter i varierte sammenhenger.

source: make and explore geometric patterns and describe them orally
nb: lage og utforske geometriske mønster og beskrive dem muntlig

source: Today, however, Sofie is determined to sit on a blanket on the floor.
nb: Men i dag vil Sofie sitte på et teppe på gulvet.

source: use and interpret the scalar and vector product in the calculation of distances, angles, area and volume
nb: bruke og tolke skalar- og vektorproduktet i beregning av avstander, vinkler, areal og volum

source: analyse circumstances that can affect older people’s participation in professional and social life, and assess different forms of care of the elderly
nb: analysere forhold som kan påvirke eldres deltakelse i yrkes- og samfunnsliv, og vurdere ulike former for eldreomsorg

source: Having oral skills means being able to both listen and speak.
nb: Muntlige ferdigheter innebærer både å kunne lytte og å kunne tale.

source: talk about Hinduism and how religious practice is expressed in maxims, rules of conduct, prayer, Puja, food traditions and holidays
nb: samtale om hinduismen og hvordan religiøs praksis kommer til uttrykk gjennom leveregler, puja, matregler og høytider

source: find information in texts or in practical situations, choose an arithmetic operation and provide rationale for the choice, use knowledge of tables about the arithmetic operations and exploit simple relations between the arithmetic operations
nb: finne informasjon i tekster eller praktiske sammenhenger, velge regneart og begrunne valget, bruke tabellkunnskap og utnytte sammenhenger mellom regneartene, vurdere resultatet og presentere løsningen

source: And why is it so important?
nb: Og hvorfor er det så viktig?

source: carry out art and design processes by seeking inspiration, exploring possibilities, making choices and making their own products
nb: Å gjennomføre er å iverksette, utføre og fullføre, for eksempel en oppgave, en undersøkelse eller et planlagt arbeid.

source: recognise and describe characteristics of simple two- and three-dimensional figures in connection with corners, edges and surfaces, and sort and name the figures according to these characteristics
nb: gjenkjenne og beskrive trekk ved enkle to- og tredimensjonale figurer i forbindelse med hjørner, kanter og flater, og sortere og sette navn på figurene etter disse trekkene

source: Being able to read also means processing and using varied information from images, film, drawings, graphs, tables, globes and maps.
nb: Å kunne lese betyr samtidig å behandle og bruke variert informasjon fra bilder, film, tegninger, grafer, tabeller, globus og kart.

source: The programme itself is a national one, but there have also been numerous local (and other national) initiatives linked to assessment and learning.
nb: Lærerne vi intervjuet snakket mye om det generelle arbeidet i skolen for trivsel, som de så som en forutsetning for godt læringsmiljø og god medvirkning.

source: Should Nikolaj routinely be allowed to wear dresses at kindergarten?
nb: Skal Nikolaj få lov til å gå med kjole til daglig i barnehagen?

source: cite and evaluate sources in relevant linguistic situations
nb: vurdere språklige nyanser ved oversettelser fra andre språk som eleven mestrer

source: The main subject area also includes developing different linguistic roles and genres and gaining an understanding of how to adapt language and form to different recipients and purposes.
nb: Hovedområdet omhandler utvikling av ulike språklige roller og sjangere og forståelse for hvordan man tilpasser språk og form til mottaker, kommunikasjonssituasjon og til formål med teksten.

source: in Norwegian is also a goal of the Norwegian subject curriculum, from the initial writing lessons to the development of writing skills throughout the 13 years of schooling.
nb: i samisk som førstespråk er et ansvarsområde i faget, fra den første skriveopplæringen til den videre skriveopplæringen gjennom 13 år.

source: The teaching shall promote development in the Norwegian language, so that pupils can be enabled to follow regular instruction in Norwegian and in other subjects taught in Norwegian.
nb: Opplæringen skal fremme norskspråklig utvikling, slik at elevene blir i stand til å følge ordinær opplæring i norsk og andre fag på norsk.

source: The pupils encounter examples of and reflect on how art, crafts and design mirror and play a role in the shaping of culture, social development and human identity.
nb: Elevene skal møte eksempler på og reflektere over hvordan kunst, håndverk og design speiler og er med på å forme kultur, samfunnsutvikling og folks identitet.

source: investigate the characteristics of materials and share their sensory
nb: undersøke egenskaper ved materialer og dele sanseerfaringer utforske ulike visuelle uttrykk og bygge videre på andres ideer i eget

source: The education shall promote cultural under-standing and develop self-insight and identity, respect and tolerance.
nb: Opplæringen skal fremme kulturforståelse og bidra til utvikling av både selvinnsikt og identitet, respekt og tole­ranse.

source: strategies for calculating with decimal numbers and
nb: strategier for regning med desimaltall og

source: give an account of implication and equivalence, and implement direct and contrapositive proof
nb: gjøre rede for implikasjon og ekvivalens, og gjennomføre direkte og kontrapositive bevis

source: Religion and ethics - common core subjects in Programme for general studies (REL1-01)
nb: Læreplan i religion og etikk - fellesfag i studieforberedende utdanningsprogram (REL1-01)

source: The analysis can also apply to a work process.
nb: Analysen kan også gjelde en arbeidsprosess.

source: Statistics and probability
nb: Statistikk og sannsynlighet

source: ‘On that account, kindergarten life often moves in unexpected directions for staff members.
nb: Livet i barnehagen tar derfor ofte andre veier enn de som er forventet på forhånd.

source: Moen believes there are several reasons.
nb: Moen tror det kan være flere grunner til dette.

source: Children are not allowed in the staff room.
nb: Det er ikke lov for barn å gå inn på møterommet.

source: explore, describe and argue for relationships between the length of the
nb: utforske, beskrive og argumentere for sammenhenger mellom

source: master some strategies for understanding and learning new words and concepts
nb: beherske noen strategier for å forstå og lære nye ord og begreper

source: In this case, Malin got to express her opinion, even though the others did not agree with her.
nb: I dette tilfellet fikk Malin uttrykt hva hun mente, selv om de andre ikke var enige med henne.

source: discuss the origin and meaning of a selection of well known proverbs and idioms
nb: samtale om noen likheter og forskjeller mellom tegnspråk og norsk

source: And about being respected even if one doesn’t always want to do what the adults say, according to the researchers’, says Seland.
nb: Og om å bli respektert for at man ikke alltid vil gjøre det de voksne sier, mener forskerne.

source: describe the human skeleton and muscles and elaborate on how the body can move
nb: beskrive skjelettet og muskler og gjøre greie for hvordan kroppen kan bevege seg

source: Political processes and institutions
nb: politiske prosesser og institusjoner

source: Power and authority limit the right to be heard.
nb: Makt og autoritet begrenser retten til å bli hørt.

source: use various aids critically and independently
nb: velge og bruke ulike strategier tilpasset formålet

source: Physics - programme subject in programmes for specialization in general studies (FYS1-01)
nb: Læreplan i fysikk - programfag i utdanningsprogram for studiespesialisering (FYS1-01)

source: New, more contagious virus variants have gained a foothold in Norway.
nb: Det tilstrebes at foresatte ikke blir med inn på skolen/ i garderoben hvis ikke det er nødvendig.

source: Also included in the main subject area are important declarations and conventions in international politics.
nb: Viktige erklæringer og konvensjoner i internasjonal politikk inngår i hovedområdet.

source: Moen finds this difference remarkable.
nb: Moen mener denne forskjellen er påfallende.

source: Communication and culture 3
nb: Kommunikasjon og kultur 3

source: To succeed, a pedagogical leader must be present and close – both as a leader and as a kindergarten teacher.
nb: For å lykkes må hun være tilstedeværende og nær – både som leder og barnehagelærer.

source: Under the auspices of the major joint Nordic research project ‘Education for Tomorrow’, 25 researchers have taken a closer look at the topic of values in ECEC institutions.
nb: I det store fellesnordiske forskningsprosjektet Education for Tomorrow har 25 forskere sett nærmere på temaet verdier i barnehagen.

source: The teacher and pupils shall engage in dialogue with the pupils about their development in programming and strategies to solve problems.
nb: Læreren og elevene skal være i dialog om elevenes utvikling i programmering og strategier for å løse problemer.

source: It also means being able to calculate the difference between condition variables and flow variables, and the difference between levels and growth.
nb: Det betyr også å kunne beregne forskjellen mellom tilstandsvariabler og strømningsvariabler, og mellom nivå og vekst.

source: describe genre characteristics in fairy tales and stories
nb: beskrive likheter og forskjeller mellom døvekultur og norsk kultur før og nå

source: Basic Norwegian for language minorities is a level-oriented plan not related to age.
nb: Læreplan i morsmål for språklige minoriteter er en aldersuavhengig og nivåbasert plan.

source: Digital skills in the subject of Social science are learned through a process that begins with the use of digital tools to find and communicate the content of one’s findings.
nb: Digitale ferdigheter i samfunnsfag oppøves i en prosess som begynner med å bruke digitale verktøy til å finne og gjengi samfunnsfaglig innhold.

source: compare magnitudes using suitable measuring tools and simple calculations, present the results and evaluate whether the results are reasonable or not
nb: sammenligne størrelser ved hjelp av passende måleredskaper og enkel beregning, presentere resultatene og vurdere om de er rimelige

source: In actual practice, this safety belt was rarely used’, Jordal clarifies.
nb: I praksis ble denne mekanismen sjelden tatt i bruk, forteller Jordal.

source: reflect on the relationship between language, culture and identity
nb: reflektere over sammenhengen mellom språk, kultur og identitet

source: They come from all social strata and all walks of life.
nb: De kommer fra alle sosiale lag og alle typer yrker.

source: The particular attention attached to doing exercises also corresponds with results from previous TIMSS studies of mathematics instruction in primary and lower secondary school.
nb: Den store vektleggingen av oppgaveløsing samsvarer også med resultater fra tidligere TIMSS-studier av undervisning i matematikk i grunnskolen.

source: Experience of and insights into cultural conditions represent a source of personal growth and maturity, and can provide greater opportunities in education, working life and leisure time.
nb: Når vi er bevisst hvilke strategier som brukes for å lære fremmedspråk, og hvilke strategier som hjelper oss til å forstå og bli forstått, blir tilegnelsen av kunnskaper og ferdigheter enklere og mer meningsfylt.

source: read and analyse linguistic devices in different genres
nb: produsere og vurdere egne tekster i ulike sjangere

source: They enjoy a meal of pasta with meat sauce.
nb: Ved de to bordene spiser de pasta og kjøttdeig.

source: in Mathematics X involves the ability to formulate logical arguments, explain a mode of thought and articulate findings, concepts and hypotheses.
nb: i matematikk X innebærer å formulere logiske resonnementer, forklare en tankegang og sette ord på oppdagelser, ideer og hypoteser.

source: Figure 2.9 Teachers’ responses to the frequency of using calculators for diverse purposes in mathematics lessons (3MX in Norway).
nb: Figur 2.9 Lærernes svar på hvor ofte elevene bruker kalkulator til ulike aktiviteter i matematikktimene (3MX i Norge).

source: use their own experiences to talk about similarities and differences between Norwegian and their mother tongue
nb: bruke egne erfaringer til å snakke om likheter og forskjeller mellom norsk og eget morsmål

source: explain how employment and unemployment are measured
nb: forklare hvordan sysselsetting og arbeidsledighet måles
